INSERT INTO Users (u_id, u_nickname, u_password, u_login_id)
VALUES
(1, '테스트회원', '1234', 'test01'),
(2, '프로젝트작성자', '1234', 'test02');

INSERT INTO Projects
(p_id, u_id, p_title, p_description, p_goal, p_current, p_end, p_status)
VALUES
(1, 1, '프로젝트 1', '개발 프로젝트를 소개하는 설명입니다.', 1000000, 200000, '2026-06-30', '진행중'),
(2, 1, '프로젝트 2', '개발 프로젝트를 소개하는 설명입니다.', 1000000, 350000, '2026-06-30', '진행중'),
(3, 2, '프로젝트 3', '개발 프로젝트를 소개하는 설명입니다.', 1000000, 500000, '2026-06-30', '진행중'),
(4, 2, '프로젝트 4', '개발 프로젝트를 소개하는 설명입니다.', 1000000, 120000, '2026-06-30', '진행중'),
(5, 1, '프로젝트 5', '개발 프로젝트를 소개하는 설명입니다.', 1000000, 760000, '2026-06-30', '진행중'),
(6, 2, '프로젝트 6', '개발 프로젝트를 소개하는 설명입니다.', 1000000, 430000, '2026-06-30', '진행중');

INSERT INTO Funding
(f_id, u_id, p_id, f_amount)
VALUES
(1, 1, 3, 50000),
(2, 1, 4, 30000),
(3, 2, 1, 100000),
(4, 1, 2, 70000);

COMMIT;

SELECT COUNT(*) FROM Users;
SELECT COUNT(*) FROM Projects;
SELECT COUNT(*) FROM Funding;